"""

Домашнее задание №1

Цикл for: Продажи товаров

* Дан список словарей с данными по количеству проданных телефонов
  [
    {'product': 'iPhone 12', 'items_sold': [363, 500, 224, 358, 480, 476, 470, 216, 270, 388, 312, 186]}, 
    {'product': 'Xiaomi Mi11', 'items_sold': [317, 267, 290, 431, 211, 354, 276, 526, 141, 453, 510, 316]},
    {'product': 'Samsung Galaxy 21', 'items_sold': [343, 390, 238, 437, 214, 494, 441, 518, 212, 288, 272, 247]},
  ]
* Посчитать и вывести суммарное количество продаж для каждого товара
* Посчитать и вывести среднее количество продаж для каждого товара
* Посчитать и вывести суммарное количество продаж всех товаров
* Посчитать и вывести среднее количество продаж всех товаров
"""

def main():
  data = [
         {'product': 'iPhone 12', 'items_sold': [363, 500, 224, 358, 480, 476, 470, 216, 270, 388, 312, 186]}, 
         {'product': 'Xiaomi Mi11', 'items_sold': [317, 267, 290, 431, 211, 354, 276, 526, 141, 453, 510, 316]},
         {'product': 'Samsung Galaxy 21', 'items_sold': [343, 390, 238, 437, 214, 494, 441, 518, 212, 288, 272, 247]}
  ]  
  z = 0
  n = 0
  for phone in data:
    print(phone["product"])
    s = 0
    for item in phone["items_sold"]:
      s = s + item
    print(f'{"Всего проданных телефонов"} {phone["product"]} : {s}')
    z = z + s
    y = len(phone["items_sold"])
    s = s / y
    n = n + y 
    print(f'{"Среднее кол-во продаж"} {phone["product"]} : {round(s)}')
  print(f'{"Суммарное кол-во всех продаж"} : {z}')
  z = z / n
  print(f'{"Среднее кол-во продаж всех товаров"} {round(z)}')



if __name__ == "__main__":
  main()



