"""

Домашнее задание №1

Цикл while: ask_user со словарём

* Создайте словарь типа "вопрос": "ответ", например:
  {"Как дела": "Хорошо!", "Что делаешь?": "Программирую"} и так далее
* Напишите функцию ask_user() которая с помощью функции input()
  просит пользователя ввести вопрос, а затем, если вопрос есть
  в словаре, программа давала ему соотвествующий ответ. Например:

    Пользователь: Что делаешь?
    Программа: Программирую
*   
    
"""

def ask_user(answers_dict):
    """
    Замените pass на ваш код
    """
    while True:
      ask_user = input("Введи вопрос или стоп: ") 
      if ask_user.lower() == "стоп":
        break
      x = 0
      for s in answers_dict:
        if s["question"] == ask_user:
          print(s['answer'])
          x = 1
          break
      if x == 0:
        print("Такого вопроса нет")


qanda = [
  {'question': 'Как дела?', 'answer': 'Хорошо'},
  {'question': 'Что делаешь?', 'answer': 'Играю'}, 
  {'question': 'О чем думаешь?', 'answer': 'О тебе'}
]  

if __name__ == "__main__":
    ask_user(qanda)



